public class valiable {

    public static void main(String[] args) {
        //1. สร้างตัวแปร ประเภท ตัวเลขจำนวนเต็ม 4 ชนิด สมมติค่าในตัวแปร และเขียนคำอธิบาย
        byte studentInRoom = 33; // จำนวนนักเรียนในห้อง ทธ1
        short scoreGame = 20245; // จำนวนคะแนนในเกม
        int studentID = 10115; // รหัสนักศึกษา
        long fish = 25410325; //จำนวนปลาในแม่น้ำแห่งหนึ่ง

        //2. สร้างตัวแปร ประเภท ตัวเลขจำนวนทศนิยม 2 ชนิด สมมติค่าในตัวแปร และเขียนคำอธิบาย
        float a = 1.25f;
        double money = 105.23;

        //3. สร้างตัวแปร ประเภท ตัวอักษรจำนวน 1 ชนิด สมมติค่าในตัวแปร และเขียนคำอธิบาย
        char gender = 'm'; //ตัวแปรเก็บข้อมูลเพศ

        //4. สร้างตัวแปร Boolean สมมติค่าในตัวแปร และเขียนคำอธิบาย
        boolean life = true; //ตัวแปรเก็บข้อมูลสถานะการมีชีวิตของมนุษย์

        //5. สร้างตัวแปรแบบค่าคงที่ กำหนดค่าในตัวแปร และเขียนคำอธิบาย
        final int dayOfWeek = 7; // ตัวแปรค่าคงที่เก็บจำนวนวันใน 1 สัปดาห์







        //6. แสดงผลตัวแปร

        //7. ทำสอบนำตัวแปรมาคำนวณ (+,-,*,/)
    }
}